Revit 2026 API
RebarConstraint.IsReferenceValidForConstraint Method
 Checks if the reference provided can be used in creating Rebar constraints
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public bool IsReferenceValidForConstraint(
	Reference targetReference
)
Public Function IsReferenceValidForConstraint (
	targetReference As Reference
) As Boolean
public:
bool IsReferenceValidForConstraint(
	Reference^ targetReference
)
member IsReferenceValidForConstraint :
        targetReference : Reference -> bool
Parameters
targetReference Reference
 The reference to be checked
Return Value
Boolean
 returns true if reference can be used in a constraint, false otherwise
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Reference is valid if it points to an uncut face of a structural that can host rebar.
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace